Autodesk.Navisworks.Api.Data.NavisworksParameterCollection
Implementation of DbParameterCollection.

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Add(Autodesk.Navisworks.Api.Data.NavisworksParameter)
Adds a parameter to the collection
parameter: The parameter to add
Returns: A zero-based index of where the parameter is located in the array

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Add(System.Object)
Adds a parameter to the collection
value: The parameter to add
Returns: A zero-based index of where the parameter is located in the array

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.AddRange(System.Array)
Adds an array of parameters to the collection
values: The array of parameters to add

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.AddWithValue(System.String,System.Object)
Adds a named/unnamed parameter and its value to the parameter collection.
parameterName: Name of the parameter, or null to indicate an unnamed parameter
value: The initial value of the parameter
Returns: Returns the NavisworksParameter object created during the call.

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Clear
Clears the array and resets the collection

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Contains(System.Object)
Determines if the parameter exists in the collection
value: The NavisworksParameter to check
Returns: True if the parameter is in the collection

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Contains(System.String)
Determines if the named parameter exists in the collection
value: The name of the parameter to check
Returns: True if the parameter is in the collection

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.CopyTo(System.Array,System.Int32)
Not implemented

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Count
Returns a count of parameters in the collection

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Dispose


Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Dispose(System.Boolean)


Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.GetParameter(System.Int32)
Retrieves a parameter by its index in the collection
index: The index of the parameter to retrieve
Returns: A DbParameter object

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.GetParameter(System.String)
Retrieve a parameter by name from the collection
parameterName: The name of the parameter to fetch
Returns: A DbParameter object

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.IndexOf(System.Object)
Returns the index of a parameter
value: The parameter to find
Returns: -1 if not found, otherwise a zero-based index of the parameter

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.IndexOf(System.String)
Returns the index of a parameter given its name
parameterName: The name of the parameter to find
Returns: -1 if not found, otherwise a zero-based index of the parameter

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Insert(System.Int32,System.Object)
Inserts a parameter into the array at the specified location
index: The zero-based index to insert the parameter at
value: The parameter to insert

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.IsFixedSize
Returns false

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.IsReadOnly
Returns false

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.IsSynchronized
Returns true

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Item(System.Int32)
Overloaded to specialize the return value of the default indexer
index: The index of the parameter to get/set
Returns: The specified NavisworksParameter

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Item(System.String)
Overloaded to specialize the return value of the default indexer
parameterName: Name of the parameter to get/set
Returns: The specified named NavisworksParameter

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.Remove(System.Object)
Removes specified parameter from the collection
value: The parameter to remove

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.RemoveAt(System.Int32)
Removes a parameter from the collection given its index
index: The zero-based parameter index to remove

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.RemoveAt(System.String)
Removes a parameter from the collection given its name
parameterName: The name of the parameter to remove

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.SetParameter(System.Int32,System.Data.Common.DbParameter)
Re-assign a parameter at the specified index
index: The zero-based index of the parameter to replace
value: The new parameter

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.SetParameter(System.String,System.Data.Common.DbParameter)
Re-assign the named parameter to a new parameter object
parameterName: The name of the parameter to replace
value: The new parameter

Autodesk.Navisworks.Api.Data.NavisworksParameterCollection.SyncRoot
Returns null